[{"trading_strategy": "Ranked Time Series Delta of Retained Earnings to Shares Outstanding", "description": "This is a long/short equity strategy. It calculates the time series delta (change) of the ratio of retained earnings to shares outstanding over a 64-day period. The rank of this delta is then taken. The strategy likely goes long stocks with increasing retained earnings per share and short stocks with decreasing retained earnings per share. The holding period is implicitly 64 days, as it is the period used to calculate the time series delta. The region is China (USA) and the universe is TOPZOOOU. Neutralization is applied at 0.15 level to Industry.", "region": "USA", "code": "rank(group_neutralize(ts_delta(divide(retained_earnings, sharesout), 64), industry), 0.15)"}, {"trading_strategy": "Time Series Rank of Operating Income to Close Price", "description": "This is a long/short equity strategy. It calculates the time series rank of the ratio of operating income to close price over a 210-day period. The strategy likely goes long stocks with high operating income relative to their close price and short stocks with low operating income relative to their close price. The holding period is implicitly 210 days, as it is the period used to calculate the time series rank. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Industry.", "region": "USA", "code": "ts_rank(divide(operating_income, close), 210)"}, {"trading_strategy": "Time Series Rank of Operating Income to Open Price", "description": "This is a long/short equity strategy. It calculates the time series rank of the ratio of operating income to open price over a 200-day period. The strategy likely goes long stocks with high operating income relative to their open price and short stocks with low operating income relative to their open price. The holding period is implicitly 200 days, as it is the period used to calculate the time series rank. The region is USA and the universe is TOPSOO. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "ts_rank(divide(operating_income, open), 200)"}, {"trading_strategy": "Liabilities to Assets Ratio", "description": "This is a long/short equity strategy. It uses the ratio of liabilities to assets as a factor. The strategy likely goes short stocks with high liabilities relative to their assets and long stocks with low liabilities relative to their assets. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Industry.", "region": "USA", "code": "group_neutralize(scale(divide(liabilities, assets)), industry)"}, {"trading_strategy": "Time Series Mean of Other Income/Loss", "description": "This is a long/short equity strategy. It calculates the time series mean of 'fn_oth_income_loss_fx_transaction_and_tax_translation_adj_a' over a 180-day period. The strategy likely goes long stocks with increasing other income/loss and short stocks with decreasing other income/loss. The holding period is implicitly 180 days, as it is the period used to calculate the time series mean. The region is USA and the universe is TOP2OO. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "group_neutralize(ts_delta(mean(pretax_income, 180),1), subindustry)"}, {"trading_strategy": "SCL12 Buzz", "description": "This is a long/short equity strategy. It uses the negative of 'scl12_buzz' as a factor. The strategy likely goes short stocks with high 'scl12_buzz' and long stocks with low 'scl12_buzz'. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Market.", "region": "USA", "code": "scale(normalize(scl12_buzz))"}, {"trading_strategy": "Time Series Rank of FND6_FOPO to Debt_LT", "description": "This is a long/short equity strategy. It calculates the time series rank of the ratio of 'fnd6_fopo' to 'debt_lt' over a 345-day period. The strategy likely goes long stocks with high 'fnd6_fopo' relative to their long-term debt and short stocks with low 'fnd6_fopo' relative to their long-term debt. The holding period is implicitly 345 days, as it is the period used to calculate the time series rank. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Sector.", "region": "USA", "code": "ts_rank(divide(mdl175_revenuettm,debt), 345)"}, {"trading_strategy": "Trade When PCR_OI < 1 based on Implied Volatility Spread", "description": "This is a conditional trading strategy. It trades only when 'pcr_oi_270' is less than 1. When this condition is met, it trades based on the spread between implied volatility of calls and puts with a 270-day tenor ('implied_volatility_call_270' - 'implied_volatility_put_270'). If the spread is positive, the strategy goes long; if the spread is negative, the strategy goes short. If the condition is not met, the strategy does nothing. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Market.", "region": "USA", "code": "trade_when(less(mdl175_volatility, 1), scale(returns, scale=1, longscale=1, shortscale=1), greater(mdl175_volatility, 1))"}, {"trading_strategy": "Time Series Mean of Other Income/Loss (160 days)", "description": "This is a long/short equity strategy. It calculates the time series mean of 'fn_oth_income_loss_fx_transaction_and_tax_translation_adj_a' over a 160-day period. The strategy likely goes long stocks with increasing other income/loss and short stocks with decreasing other income/loss. The holding period is implicitly 160 days, as it is the period used to calculate the time series mean. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "group_neutralize(ts_mean(returns, 160), subindustry)"}, {"trading_strategy": "News Sentiment and Price Momentum", "description": "This is a combined news sentiment and price momentum strategy. First, it calculates the average news sentiment using 'vec_avg(nws12_afterhsz_sl)'. Then, it calculates the rank of the time series sum of the average news sentiment over 60 days. If this rank is greater than 0.5, the strategy goes long. Otherwise, it calculates the rank of the negative time series delta of the close price over 2 days and uses that as the signal. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Sector.", "region": "USA", "code": "If(Greater(Rank(Ts_Sum(Scl12_Sentiment, 60)), 0.5), 1, Rank(Ts_Delta(Close, 2)))"}, {"trading_strategy": "Time Series Mean of Other Income/Loss (300 days)", "description": "This is a long/short equity strategy. It calculates the time series mean of 'fn_oth_income_loss_fx_transaction_and_tax_translation_adj_a' over a 300-day period. The strategy likely goes long stocks with increasing other income/loss and short stocks with decreasing other income/loss. The holding period is implicitly 300 days, as it is the period used to calculate the time series mean. The region is USA and the universe is TOPSOO. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "group_neutralize(ts_mean(returns, 300), subindustry)"}, {"trading_strategy": "Ranked Time Series Delta of Retained Earnings to Shares Outstanding (Replicated)", "description": "This is a long/short equity strategy. It calculates the time series delta (change) of the ratio of retained earnings to shares outstanding over a 64-day period. The rank of this delta is then taken. The strategy likely goes long stocks with increasing retained earnings per share and short stocks with decreasing retained earnings per share. The holding period is implicitly 64 days, as it is the period used to calculate the time series delta. The region is China (USA) and the universe is TOPZOOOU. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "rank(ts_delta(divide(retained_earnings, sharesout), 64))"}, {"trading_strategy": "Returns and Volume/ADV20", "description": "This is a long/short equity strategy that combines returns and volume relative to average daily volume (ADV) over 20 days. It multiplies the rank of negative returns by the rank of volume divided by ADV20. The strategy likely goes long stocks with low recent returns and high relative volume, and short stocks with high recent returns and low relative volume. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.01 level to Sector.", "region": "USA", "code": "rank(multiply(rank(nan_mask(returns, multiply(sign(returns), -1))), rank(divide(volume, adv20))), rate=2)"}, {"trading_strategy": "Time Series Rank of Liabilities Fair Value L1", "description": "This is a long/short equity strategy. It calculates the negative time series rank of 'fn_liab_fair_val_l1_a' over a 129-day period. The strategy likely goes short stocks with high 'fn_liab_fair_val_l1_a' and long stocks with low 'fn_liab_fair_val_l1_a'. The holding period is implicitly 129 days, as it is the period used to calculate the time series rank. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.01 level to Subindustry.", "region": "USA", "code": "group_neutralize(ts_rank(liabilities, 129), subindustry)"}, {"trading_strategy": "Returns and Volume/ADV20 (Replicated)", "description": "This is a long/short equity strategy that combines returns and volume relative to average daily volume (ADV) over 20 days. It multiplies the rank of negative returns by the rank of volume divided by ADV20. The strategy likely goes long stocks with low recent returns and high relative volume, and short stocks with high recent returns and low relative volume. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Sector.", "region": "USA", "code": "rank(multiply(rank(subtract(0, returns)), rank(divide(volume, adv20))))"}, {"trading_strategy": "Quantile of Time Series Rank of Pretax Income", "description": "This is a long/short equity strategy. It calculates the quantile of the time series rank of pretax income over a 240-day period. The strategy likely goes long stocks in the higher quantiles and short stocks in the lower quantiles. The region is China (USA) and the universe is TOPZOOOU. Neutralization is applied at 0.01 level to Market.", "region": "USA", "code": "quantile(ts_rank(pretax_income, 240), driver=\"gaussian\")"}, {"trading_strategy": "Implied Volatility Call/Parkinson Volatility", "description": "This is a long/short equity strategy. It uses the ratio of implied volatility of calls to Parkinson volatility, both with a 120-day tenor. The strategy likely goes long stocks with high implied volatility relative to Parkinson volatility and short stocks with low implied volatility relative to Parkinson volatility. The region is USA and the universe is TOP1OOO. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "group_neutralize(normalize(divide(mdl175_volatility, std_dev(close, 120))), subindustry)"}, {"trading_strategy": "Decline Percentage with Time Decay", "description": "This is a long/short equity strategy that uses a combination of price decline and time decay. It calculates the decline percentage as (vwap - close) / vwap. It then divides this by the minimum of a time-decayed function of the relative days since the maximum close (ts_decay_linear(rel_days_since_max, decay_days)) and 0.01. The strategy likely goes long stocks with a large decline percentage relative to their time since the maximum close. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Sector. The formula is: decline_pct / min(ts_decay_linear(rel_days_since_max, decay_days), 0.01) where decline_pct = (vwap - close) / vwap and rel_days_since_max = rank(ts_arg_max(close, 30)).", "region": "USA", "code": "divide(divide(subtract(vwap, close), vwap), min(ts_decay_linear(rank(ts_arg_max(close, 30)), 30), 0.01))"}, {"trading_strategy": "News Sentiment and Time Since Max News", "description": "This is a conditional trading strategy based on news sentiment and the time since the most recent news event. First, it backfills news data using 'ts_backfill(news_session_range, 20)'. Then, it calculates the days since the maximum news event using 'ts_arg_max(new_data, 60)'. A weight is calculated as '-exp(-days_since_max_news)'. The strategy only trades if 'days_since_max_news' is less than 30. If this condition is met, it trades with the calculated weight; otherwise, it takes a short position. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "IF(LT(ts_arg_max(scl12_buzz, 60), 30), multiply(-exp(-ts_arg_max(scl12_buzz, 60)), scale(normalize(scl12_sentiment))), -1)"}]