[{"trading_strategy": "Ranked Time Series Delta of Retained Earnings to Shares Outstanding", "description": "This is a long/short equity strategy. It calculates the time series delta (change) of the ratio of retained earnings to shares outstanding over a 64-day period. The rank of this delta is then taken. The strategy likely goes long stocks with increasing retained earnings per share and short stocks with decreasing retained earnings per share. The holding period is implicitly 64 days, as it is the period used to calculate the time series delta. The region is China (USA) and the universe is TOPZOOOU. Neutralization is applied at 0.15 level to Industry.", "region": "USA", "code": "rank(group_neutralize(ts_delta(divide(retained_earnings, sharesout), 64), industry), 0.15)", "neutralizations": ["industry"]}, {"trading_strategy": "Time Series Rank of Operating Income to Close Price", "description": "This is a long/short equity strategy. It calculates the time series rank of the ratio of operating income to close price over a 210-day period. The strategy likely goes long stocks with high operating income relative to their close price and short stocks with low operating income relative to their close price. The holding period is implicitly 210 days, as it is the period used to calculate the time series rank. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Industry.", "region": "USA", "code": "ts_rank(divide(operating_income, close), 210)", "neutralizations": ["industry"]}, {"trading_strategy": "Time Series Rank of Operating Income to Open Price", "description": "This is a long/short equity strategy. It calculates the time series rank of the ratio of operating income to open price over a 200-day period. The strategy likely goes long stocks with high operating income relative to their open price and short stocks with low operating income relative to their open price. The holding period is implicitly 200 days, as it is the period used to calculate the time series rank. The region is USA and the universe is TOPSOO. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "ts_rank(divide(operating_income, open), 200)", "neutralizations": ["industry"]}, {"trading_strategy": "Liabilities to Assets Ratio", "description": "This is a long/short equity strategy. It uses the ratio of liabilities to assets as a factor. The strategy likely goes short stocks with high liabilities relative to their assets and long stocks with low liabilities relative to their assets. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Industry.", "region": "USA", "code": "group_neutralize(scale(divide(liabilities, assets)), industry)", "neutralizations": ["industry"]}, {"trading_strategy": "Time Series Mean of Other Income/Loss", "description": "This is a long/short equity strategy. It calculates the time series mean of 'fn_oth_income_loss_fx_transaction_and_tax_translation_adj_a' over a 180-day period. The strategy likely goes long stocks with increasing other income/loss and short stocks with decreasing other income/loss. The holding period is implicitly 180 days, as it is the period used to calculate the time series mean. The region is USA and the universe is TOP2OO. Neutralization is applied at 0.08 level to Subindustry.", "region": "USA", "code": "group_neutralize(ts_delta(mean(pretax_income, 180),1), subindustry)", "neutralizations": ["industry"]}, {"trading_strategy": "SCL12 Buzz", "description": "This is a long/short equity strategy. It uses the negative of 'scl12_buzz' as a factor. The strategy likely goes short stocks with high 'scl12_buzz' and long stocks with low 'scl12_buzz'. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Market.", "region": "USA", "code": "scale(normalize(scl12_buzz))", "neutralizations": ["industry", "subindustry"]}, {"trading_strategy": "Time Series Rank of FND6_FOPO to Debt_LT", "description": "This is a long/short equity strategy. It calculates the time series rank of the ratio of 'fnd6_fopo' to 'debt_lt' over a 345-day period. The strategy likely goes long stocks with high 'fnd6_fopo' relative to their long-term debt and short stocks with low 'fnd6_fopo' relative to their long-term debt. The holding period is implicitly 345 days, as it is the period used to calculate the time series rank. The region is USA and the universe is TOP3OOO. Neutralization is applied at 0.08 level to Sector.", "region": "USA", "code": "ts_rank(divide(mdl175_revenuettm,debt), 345)", "neutralizations": ["industry"]}]